In [62]:
import pandas as pd

In [63]:
df = [["Martial" , 23],["Rohit" , 54], ["Emilly" , 28], ["Harry" , 18], ["Riya" , 31]]
df

[['Martial', 23], ['Rohit', 54], ['Emilly', 28], ['Harry', 18], ['Riya', 31]]

In [64]:
pd.DataFrame(df,columns=["Name","Age"])

      Name  Age
0  Martial   23
1    Rohit   54
2   Emilly   28
3    Harry   18
4     Riya   31

In [65]:
data = {"a" : [1,2,3,4], "b" :[5,6,7,8]}
data

{'a': [1, 2, 3, 4], 'b': [5, 6, 7, 8]}

In [66]:
df = pd.DataFrame(data)
df

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [67]:
import numpy as np
arr = np.array([[1,2], [3,4]])
arr

array([[1, 2],
       [3, 4]])

In [68]:
df = pd.DataFrame(arr)
df

   0  1
0  1  2
1  3  4

In [69]:
df = pd.read_excel("Test_Data01.xlsx")
df

    Name's School  Mark's
0    Anish   SPHS      82
1   Naveen   SMHS      90
2     Abhi    GSP      85
3   Stevan    MGA      45
4     Riya    REQ      99
5  Shivani    DPS      60
6      Joy    DRM      69

In [70]:
df = pd.read_json("Data.json")
df

    Name Language  Age
0  Anish   Python   22
1   Riya    React   24

In [71]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [72]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [73]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [76]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [79]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [80]:
df.shape

(244, 7)